Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/svd/PIC32CM5164LS00064.svd
            </cluster>
            <register>
               <dim>52</dim>
               <dimIncrement>1</dimIncrement>
               <name>USER[%s]</name>
               <description>User Multiplexer n</description>
               <addressOffset>0x120</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CHANNEL</name>
                     <description>Channel Event Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x1D4</addressOffset>
               <size>8</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NSCHK</name>
                     <description>Non-Secure Check Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x1D5</addressOffset>
               <size>8</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NSCHK</name>
                     <description>Non-Secure Check Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x1D6</addressOffset>
               <size>8</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NSCHK</name>
                     <description>Non-Secure Check</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONSECCHAN</name>
               <description>Channels Security Attribution</description>
               <addressOffset>0x1D8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHANNEL0</name>
                     <description>Non-Secure for Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL1</name>
                     <description>Non-Secure for Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL2</name>
                     <description>Non-Secure for Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL3</name>
                     <description>Non-Secure for Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL4</name>
                     <description>Non-Secure for Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL5</name>
                     <description>Non-Secure for Channel 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL6</name>
                     <description>Non-Secure for Channel 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL7</name>
                     <description>Non-Secure for Channel 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL8</name>
                     <description>Non-Secure for Channel 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL9</name>
                     <description>Non-Secure for Channel 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL10</name>
                     <description>Non-Secure for Channel 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL11</name>
                     <description>Non-Secure for Channel 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSCHKCHAN</name>
               <description>Non-Secure Channels Check</description>
               <addressOffset>0x1DC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHANNEL0</name>
                     <description>Channel 0 to be checked as non-secured</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL1</name>
                     <description>Channel 1 to be checked as non-secured</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL2</name>
                     <description>Channel 2 to be checked as non-secured</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL3</name>
                     <description>Channel 3 to be checked as non-secured</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL4</name>
                     <description>Channel 4 to be checked as non-secured</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL5</name>
                     <description>Channel 5 to be checked as non-secured</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL6</name>
                     <description>Channel 6 to be checked as non-secured</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL7</name>
                     <description>Channel 7 to be checked as non-secured</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL8</name>
                     <description>Channel 8 to be checked as non-secured</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL9</name>
                     <description>Channel 9 to be checked as non-secured</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL10</name>
                     <description>Channel 10 to be checked as non-secured</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL11</name>
                     <description>Channel 11 to be checked as non-secured</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONSECUSER0</name>
               <description>Users Security Attribution</description>
               <addressOffset>0x1E0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>USER0</name>
                     <description>Non-Secure for User 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER1</name>
                     <description>Non-Secure for User 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER2</name>
                     <description>Non-Secure for User 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER3</name>
                     <description>Non-Secure for User 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER4</name>
                     <description>Non-Secure for User 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER5</name>
                     <description>Non-Secure for User 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER6</name>
                     <description>Non-Secure for User 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER7</name>
                     <description>Non-Secure for User 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER8</name>
                     <description>Non-Secure for User 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER9</name>
                     <description>Non-Secure for User 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER10</name>
                     <description>Non-Secure for User 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER11</name>
                     <description>Non-Secure for User 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER12</name>
                     <description>Non-Secure for User 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER13</name>
                     <description>Non-Secure for User 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER14</name>
                     <description>Non-Secure for User 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER15</name>
                     <description>Non-Secure for User 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER16</name>
                     <description>Non-Secure for User 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER17</name>
                     <description>Non-Secure for User 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER18</name>
                     <description>Non-Secure for User 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER19</name>
                     <description>Non-Secure for User 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER20</name>
                     <description>Non-Secure for User 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER21</name>
                     <description>Non-Secure for User 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER22</name>
                     <description>Non-Secure for User 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER23</name>
                     <description>Non-Secure for User 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER24</name>
                     <description>Non-Secure for User 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER25</name>
                     <description>Non-Secure for User 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER26</name>
                     <description>Non-Secure for User 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER27</name>
                     <description>Non-Secure for User 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER28</name>
                     <description>Non-Secure for User 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER29</name>
                     <description>Non-Secure for User 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER30</name>
                     <description>Non-Secure for User 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER31</name>
                     <description>Non-Secure for User 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONSECUSER1</name>
               <description>Users Security Attribution</description>
               <addressOffset>0x1E4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>USER32</name>
                     <description>Non-Secure for User 32</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER33</name>
                     <description>Non-Secure for User 33</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER34</name>
                     <description>Non-Secure for User 34</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER35</name>
                     <description>Non-Secure for User 35</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER36</name>
                     <description>Non-Secure for User 36</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER37</name>
                     <description>Non-Secure for User 37</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER38</name>
                     <description>Non-Secure for User 38</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER39</name>
                     <description>Non-Secure for User 39</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER40</name>
                     <description>Non-Secure for User 40</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER41</name>
                     <description>Non-Secure for User 41</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER42</name>
                     <description>Non-Secure for User 42</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER43</name>
                     <description>Non-Secure for User 43</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER44</name>
                     <description>Non-Secure for User 44</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER45</name>
                     <description>Non-Secure for User 45</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER46</name>
                     <description>Non-Secure for User 46</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER47</name>
                     <description>Non-Secure for User 47</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER48</name>
                     <description>Non-Secure for User 48</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER49</name>
                     <description>Non-Secure for User 49</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER50</name>
                     <description>Non-Secure for User 50</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER51</name>
                     <description>Non-Secure for User 51</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
